ci4_biblioteca/Controllers/Emprestimo.php

    public function index(){
        $emprestimo = $this->emprestimoModel->findAll();
        $livro = $this->livroModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();
        $obra = $this->obraModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `obra`

    public function devolucao($id){
        $emprestimo = $this->emprestimoModel->find($id);
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '8'

    public function salvar_devolucao(){
        $emprestimo = $this->request->getPost();
        $this->livroModel->update($emprestimo['id_livro'], ['disponivel' => 1]);
        $this->emprestimoModel->save($emprestimo);
---
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('1')
UPDATE `emprestimo` SET `id_livro` = '1', `data_fim` = '2024-06-28'
WHERE `emprestimo`.`id` IN ('8')